students = {
    "Іван Петров" : {
        "Пошта" : "ivan@gmail.com",
        "Вік" : 14,
        "Номер телефону" : "+80987771221",
        "Середній бал" : 95.8,
    }, 
    "Женя Курич" : {
        "Пошта" : "geka@gmail.com",
        "Вік" : 16,
        "Номер телефону" : "",
        "Середній бал" : 64.5,
    },
    "Маша Кера" : {
        "Пошта" : "masha@gmail.com",
        "Вік" : 18,
        "Номер телефону" : "+80986671221",
        "Середній бал" : 80.0,
    } 
}
for attribute in students.items() :
    print (attribute)
    print()
    print("*" * 40)

print("Добавляємо одного студента.")
students["Єгор Крюков"] = {
        "Пошта" : "egor@gmail.com",
        "Вік" : 20,
        "Номер телефону" : "+80986661221",
        "Середній бал" : 90.0,
}
group_average = ((students["Іван Петров"]["Середній бал"]
                 + students["Женя Курич"]["Середній бал"]
                 + students["Маша Кера"]["Середній бал"]
                 + students["Єгор Крюков"]["Середній бал"]) / len(students))
print("Середній бал групи:  " + str(round(group_average, 1)))

x = students["Іван Петров"]["Номер банківського рахунку"] = None
print("Іван Петров, номер банківського рахунку: " + str(x))

students["Женя Курич"]["Заробітна плата"] = ""
y = students["Женя Курич"].get("Заробітна плата") or 0.0
print("Женя Курич, заробітна плата:  " + str(y))

